#Άσκηση 1.2: Απόσταση μεταξύ δύο σημείων στη Γη Γράψτε πρόγραμμα που να
#δέχεται στην είσοδο το γεωγραφικό πλάτος και μήκος δύο σημείων πάνω στη
#γη και να εμφανίζει στην έξοδο την απόσταση των δύο σημείων σε
#χιλιόμετρα.

import math

p1 = float(input("Δώσε το γεωγραφικο πλάτος του πρωτου σημείου σε μοιρες: "))
p2 = float(input("Δώσε το γεωγραφικο πλάτος του δεύτερου σημείου σε μοιρες: "))
m1 = float(input("Δώσε το γεωγραφικο μηκος του πρωτου σημείου σε μοιρες: "))
m2 = float(input("Δώσε το γεωγραφικο μηκος του δεύτερου σημείου σε μοιρες: "))
#ακτινα της Γης
R = 6372.8
#μετατροπή μοιρών σε ακτινια
p1 = math.radians(p1)
p2 = math.radians(p2)
m1 = math.radians(m1)
m2 = math.radians(m2)
#Διαφορές Γ.Π και Γ.Μ
dp = p2 - p1
dm = m2 - m1

a = math.pow(math.sin(dp),2) + (math.cos(p1))*(math.cos(p2))*math.pow(math.sin(dm),2)

c = 2*(math.asin(math.sqrt(a)))

d = R * c

print("\nΗ απόσταση των δύο σημειων ειναι", "{:.3f}".format(d), "χλμ")

