#Άσκηση 1.1 : Υπολογισμοι

#Γράψτε πρόγραμμα που να διαβάζει δύο ακέραιους που εισάγει ο χρήστης
#από το πληκτρολόγιο και τους αντιστοιχεί στα ονόματα x και y. Στη
#συνέχεια ο κώδικας να υπολογίζει τα παρακάτω και να τα εμφανίζει στην
#οθόνη με χρήση της μεθόδου .format() δεσμεύοντας 10 θέσεις για κάθε
#δεδομένο που εμφανίζει.

import math

x = int(input("Δώσε μου έναν ακέραιο x: "))
y = int(input("Δώσε μου έναν ακέραιο y: "))

#1. Το πηλίκο (πραγματικός) της διαίρεσης x διά y
print("Πηλίκο (πραγματικός) της διαίρεσης x διά y:", "{:10f}".format(x/y))

#2. Το υπόλοιπο (ακέραιος) της διαίρεσης x διά y
print("Υπόλοιπο (ακέραιος) της διαίρεσης x διά y: ","{:10f}".format(x%y))

#3. Το λογάριθμο του x με βάση y
print("Λογάριθμος του x με βάση y:", "{:10f}".format(math.log(x,y)))

#4. Την τετραγωνική ρίζα του y
print("Τετραγωνική ριζα του y:", "{:10f}".format(math.sqrt(y)))

#5 Την εκθετική ποσότητα ex όπου e η βάση των φυσικών λογαρίθμων
print("Το εκθετικο του x:", "{:10f}".format(math.exp(x)))
