#Άσκηση 2.1: Ρίζες τριωνύμου
import math

print("Καλως ήρθατε στο πρόγραμμα υπολογισμού των ριζών ενός τριωνύμου")
print("***************************************************************")
a = float(input("Δώσε μου το μη μηδενικό συντελεστή του x^2, a = "))
b = float(input("Δώσε μου το συντελεστή του x, b = "))
c = float(input("Δώσε μου τη σταθερή τιμή c = "))

d = math.pow(b,2) - 4 * a * c

equation = str(a) + "x^2 + " + str(b) + "x + " + str(c)


if (d < 0) :
    print("Το τριώνυμο ", equation, "δεν έχει πραγματικές ρίζες")

elif (d == 0) :
    x1 = (-b + math.sqrt(d)) / (2*a)
    print("Το τριώνυμο ", equation, "έχει μία διπλή ρίζα x =", x1)

else :
    x1 = (-b + math.sqrt(d)) / (2*a)
    x2 = (-b - math.sqrt(d)) / (2*a)
    print("Το τριώνυμο ", equation, "έχει δύο πραγματικές ρίζες, x1 =", "{:.2f}".format(x1), "και x2 =", "{:.2f}".format(x2))

